In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('StudentsPerformance.csv')

In [3]:
df.sample(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0,17.0,10.0
877,male,group C,some high school,standard,none,57,61.0,54.0
876,male,group D,some college,standard,none,81,82.0,84.0
957,female,group D,master's degree,standard,none,92,100.0,100.0
493,female,group C,bachelor's degree,standard,none,81,88.0,90.0

In [4]:
df.describe()

       reading score  writing score
count     994.000000     991.000000
mean       68.008048      69.487386
std        16.602270      29.563757
min         3.000000      10.000000
25%        58.000000      57.000000
50%        69.500000      69.000000
75%        79.000000      79.000000
max       100.000000     567.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   992 non-null    object
 6   reading score                994 non-null    float64
 7   writing score                991 non-null    float64
dtypes: float64(2), object(6)
memory usage: 62.6+ KB

In [6]:
df.shape

(1000, 8)

In [7]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     8
reading score                  6
writing score                  9
dtype: int64

In [25]:
df['math score'] = df['math score'].fillna(df['math score'].mean())

In [9]:
df['reading score'] = df['reading score'].fillna(method="ffill")

In [10]:
df['writing score'] = df['writing score'].fillna(method="bfill")

In [11]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [12]:
df['math score'].unique()

array(['72', '69', '90', '47', '76', '71', '88', '40', '64', '38', '58',
       '65', '78', '50', '74', '73', '67', '70', '62', '63', '56', '81',
       '75', '57', '55', '53', '59', '66', '82', '77', '33', '52', '0',
       '79', '39', '45', '60', '61', '41', '49', '44', '30', '80', '42',
       '27', '43', '68', '85', '98', '87', '54', '51', '99', '84', '91',
       '83', '89', '22', '100', '96', '94', '46', '97', '48', '35', '34',
       '86', '92', '37', '28', '24', '113', '123', '?', '-89', '26',
       '334', '95', '36', '29', '32', '93', '19', '23', '8'], dtype=object)

In [13]:
df = df.drop(df[df['math score'] == '?'].index)
df = df.drop(df[df['math score'] < '0'].index)

In [14]:
df['math score'].unique()

array(['72', '69', '90', '47', '76', '71', '88', '40', '64', '38', '58',
       '65', '78', '50', '74', '73', '67', '70', '62', '63', '56', '81',
       '75', '57', '55', '53', '59', '66', '82', '77', '33', '52', '0',
       '79', '39', '45', '60', '61', '41', '49', '44', '30', '80', '42',
       '27', '43', '68', '85', '98', '87', '54', '51', '99', '84', '91',
       '83', '89', '22', '100', '96', '94', '46', '97', '48', '35', '34',
       '86', '92', '37', '28', '24', '113', '123', '26', '334', '95',
       '36', '29', '32', '93', '19', '23', '8'], dtype=object)

In [15]:
df['math score'] = df['math score'].astype('int64')
df['reading score'] = df['reading score'].astype('int64')
df['writing score'] = df['writing score'].astype('int64')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 964 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       964 non-null    object
 1   race/ethnicity               964 non-null    object
 2   parental level of education  964 non-null    object
 3   lunch                        964 non-null    object
 4   test preparation course      964 non-null    object
 5   math score                   964 non-null    int64
 6   reading score                964 non-null    int64
 7   writing score                964 non-null    int64
dtypes: int64(3), object(5)
memory usage: 67.8+ KB

In [17]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [18]:
df['gender'].unique()

array(['female', 'male'], dtype=object)

In [19]:
df['gender'].replace(to_replace=['female', 'male'], value=[0,1], inplace=True)
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,0,group B,bachelor's degree,standard,none,72,72,74
1,0,group C,some college,standard,completed,69,90,88
2,0,group B,master's degree,standard,none,90,95,93
3,1,group A,associate's degree,free/reduced,none,47,57,44
4,1,group C,some college,standard,none,76,78,75

In [22]:
df['math score'] = (df['math score'] - df['math score'].min()) / (df['math score'].max() - df['math score'].min())

In [23]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,0,group B,bachelor's degree,standard,none,0.215569,72,74
1,0,group C,some college,standard,completed,0.206587,90,88
2,0,group B,master's degree,standard,none,0.269461,95,93
3,1,group A,associate's degree,free/reduced,none,0.140719,57,44
4,1,group C,some college,standard,none,0.227545,78,75

In [24]:
df.describe()

           gender  math score  reading score  writing score
count  964.000000  964.000000     964.000000     964.000000
mean     0.479253    0.199270      67.854772      69.534232
std      0.499829    0.052483      16.772612      29.858891
min      0.000000    0.000000       3.000000      10.000000
25%      0.000000    0.170659      58.000000      58.000000
50%      0.000000    0.197605      69.000000      69.000000
75%      1.000000    0.230539      79.000000      79.000000
max      1.000000    1.000000     100.000000     567.000000